Revit 2027 API
CableType.GetCableTypeId Method
 Gets the Cable Type id by given cable type name.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId GetCableTypeId(
	Document document,
	string name
)
Public Shared Function GetCableTypeId (
	document As Document,
	name As String
) As ElementId
public:
static ElementId^ GetCableTypeId(
	Document^ document,
	String^ name
)
static member GetCableTypeId :
        document : Document *
        name : string -> ElementId
Parameters
document Document
 The document.
name String
 The Cable Type name.
Return Value
ElementId
 The Cable Type id. InvalidElementId will be returned if no Cable Type by given name.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- name is an empty string.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
See Also
Reference
CableType Class
Autodesk.Revit.DB.Electrical Namespace